I am running into a similar issue, but the error I am receiving is slightly different: 
`Error: octopus deploy api returned an error on endpoint /api/Spaces-1/machines - [Account or certificate must be defined]`

The error is a bit misleading to me because the documentation does not show either of those as being required, and even so, we have specified `certificate_authentication`. For reference, here is what I have configured:
```hcl
resource "octopusdeploy_kubernetes_cluster_deployment_target" "k8s_dr_deployment_target" {
  cluster_url                        = "redacted_cluster_url"
  environments                       = [ "Environments-161" ]
  name                               = "k8s-dr-cluster-name"
  roles                              = [ "kubernetes" ]
  tenanted_deployment_participation  = "TenantedOrUntenanted"
  tenant_tags                        = [ "Region/uk" ]
  cluster_certificate                = octopusdeploy_certificate.k8s_dr_ca_certificate.id

  certificate_authentication {
    client_certificate = octopusdeploy_certificate.k8s_dr_certificate.id
  }
}
```

The 2 referenced certificates applied successfully and it is correctly pulling the ID of each, so I don't believe that is where the issue lies. When I enabled trace logging, I found this:

```
2021/07/29 21:38:17 [WARN] Provider "registry.terraform.io/octopusdeploylabs/octopusdeploy" produced an invalid plan for octopusdeploy_kubernetes_cluster_deployment_target.k8s_dr_deployment_target, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .aws_account_authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .azure_service_principal_authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .container: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .endpoint: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
```

I'm not sure if I am missing a needed config or if I have one configured incorrectly, and unfortunately the documentation is not very clear. It plans successfully:

```
# octopusdeploy_kubernetes_cluster_deployment_target.k8s_dr_deployment_target will be created
  + resource "octopusdeploy_kubernetes_cluster_deployment_target" "k8s_dr_deployment_target" {
      + cluster_certificate               = "Certificates-101"
      + cluster_url                       = "redacted_cluster_url"
      + environments                      = [
          + "Environments-161",
        ]
      + has_latest_calamari               = (known after apply)
      + health_status                     = (known after apply)
      + id                                = (known after apply)
      + is_DISABLED                       = (known after apply)
      + is_in_process                     = (known after apply)
      + machine_policy_id                 = (known after apply)
      + name                              = "k8s-dr-cluster-name"
      + operating_system                  = (known after apply)
      + roles                             = [
          + "kubernetes",
        ]
      + shell_name                        = (known after apply)
      + shell_version                     = (known after apply)
      + space_id                          = (known after apply)
      + status                            = (known after apply)
      + status_summary                    = (known after apply)
      + tenant_tags                       = [
          + "Region/uk",
        ]
      + tenanted_deployment_participation = "TenantedOrUntenanted"
      + tenants                           = (known after apply)
      + thumbprint                        = (known after apply)
      + uri                               = (known after apply)

      + authentication {
          + account_id = (known after apply)
        }

      + aws_account_authentication {
          + account_id                   = (known after apply)
          + assume_role                  = (known after apply)
          + assume_role_external_id      = (known after apply)
          + assume_role_session_duration = (known after apply)
          + assumed_role_arn             = (known after apply)
          + assumed_role_session         = (known after apply)
          + cluster_name                 = (known after apply)
          + use_instance_role            = (known after apply)
        }

      + azure_service_principal_authentication {
          + account_id             = (known after apply)
          + cluster_name           = (known after apply)
          + cluster_resource_group = (known after apply)
        }

      + certificate_authentication {
          + client_certificate = "Certificates-102"
        }

      + container {
          + feed_id = (known after apply)
          + image   = (known after apply)
        }

      + endpoint {
          + aad_client_credential_secret    = (known after apply)
          + aad_credential_type             = (known after apply)
          + aad_user_credential_username    = (known after apply)
          + account_id                      = (known after apply)
          + applications_directory          = (known after apply)
          + certificate_signature_algorithm = (known after apply)
          + certificate_store_location      = (known after apply)
          + certificate_store_name          = (known after apply)
          + client_certificate_variable     = (known after apply)
          + cloud_service_name              = (known after apply)
          + cluster_certificate             = (known after apply)
          + cluster_url                     = (known after apply)
          + communication_style             = (known after apply)
          + connection_endpoint             = (known after apply)
          + default_worker_pool_id          = (known after apply)
          + dot_net_core_platform           = (known after apply)
          + fingerprint                     = (known after apply)
          + host                            = (known after apply)
          + id                              = (known after apply)
          + namespace                       = (known after apply)
          + port                            = (known after apply)
          + proxy_id                        = (known after apply)
          + resource_group_name             = (known after apply)
          + running_in_container            = (known after apply)
          + security_mode                   = (known after apply)
          + server_certificate_thumbprint   = (known after apply)
          + skip_tls_verification           = (known after apply)
          + slot                            = (known after apply)
          + storage_account_name            = (known after apply)
          + swap_if_possible                = (known after apply)
          + thumbprint                      = (known after apply)
          + uri                             = (known after apply)
          + use_current_instance_count      = (known after apply)
          + web_app_name                    = (known after apply)
          + web_app_slot_name               = (known after apply)
          + working_directory               = (known after apply)

          + authentication {
              + account_id                   = (known after apply)
              + admin_login                  = (known after apply)
              + assume_role                  = (known after apply)
              + assume_role_external_id      = (known after apply)
              + assume_role_session_duration = (known after apply)
              + assumed_role_arn             = (known after apply)
              + assumed_role_session         = (known after apply)
              + authentication_type          = (known after apply)
              + client_certificate           = (known after apply)
              + cluster_name                 = (known after apply)
              + cluster_resource_group       = (known after apply)
              + use_instance_role            = (known after apply)
            }

          + container {
              + feed_id = (known after apply)
              + image   = (known after apply)
            }

          + destination {
              + destination_type = (known after apply)
              + drop_folder_path = (known after apply)
            }

          + tentacle_version_details {
              + upgrade_locked    = (known after apply)
              + upgrade_required  = (known after apply)
              + upgrade_suggested = (known after apply)
              + version           = (known after apply)
            }
        }
    }
```

Hopefully this can help track down where the issue is. I can try to provide more info if this is helpful.